//***********************************************************************
//*                                                                     *
//*   Copyright (c) 1985-2020, American Megatrends International LLC.   *
//*                                                                     *
//*      All rights reserved. Subject to AMI licensing agreement.       *
//*                                                                     *
//***********************************************************************


//<AMI_FHDR_START>
//---------------------------------------------------------------------------
//
// Name:	UefiCpuSetup.uni
//
// Description:	
//  Setup definition for UEFI CPU	
//
//---------------------------------------------------------------------------
//<AMI_FHDR_END>
/=#
#include "VFR.uni"

#langdef   x-AMI "x-AMI"    // AMI Configuration Language

//
// CPU Configuration
//
#string STR_NULL_HELP                   #language eng ""
#string STR_NULL_HELP                   #language fra ""

#string STR_UEFI_CPU_FORM               #language eng "UEFI CPU Configuration"
#string STR_UEFI_CPU_FORM               #language fra "Configuration d'Unité centrale de traitement"

#string STR_UEFI_CPU_FORM_HELP          #language eng "UEFI CPU Configuration Parameters"
#string STR_UEFI_CPU_FORM_HELP          #language fra "Paramètres De Configuration d'Unité centrale de traitement"

#string STR_DISABLED                    #language eng "Disabled"
#string STR_ENABLE                      #language eng "Enabled"
#string STR_CPU_AUTO                    #language eng "Auto"

//------------------------------------------------------------------
// SMM isolation information
#string STR_SMM_ISOLATION               #language en-US "Smm Isolation"
                                        #language x-AMI "UefiCPU001"
#string STR_SMM_ISOLATION_HELP          #language en-US "Smm Isolation enable/disable. This is for DRTM level 3 firmware protection"

